package com.liruo.communityforum.infrasturcture.constant;

/**
 * @Author:liruo
 * @Date:2023-06-18-16:31:59
 * @Desc
 */
public interface RegexConstant {
  /**
   * 可以有+86或者86或者0086前缀的86手机号
   */
  String PHONE_86 = "^(?:(?:\\+|00)86)?1(?:(?:3[\\d])|(?:4[5-79])|(?:5[0-35-9])|(?:6[5-7])|(?:7[0-8])|(?:8[\\d])|(?:9[189]))\\d{8}$";
  String URL = "^https?:\\/\\/(?:www\\.)?[-a-zA-Z0-9]{1,256}\\.[a-zA-Z0-9]{1,6}\\b(?:[-a-zA-Z0-9!@:%_\\+.~#?&\\/\\/=]*)$";
  /**
   * 中文英文数字和_
   */
  String USERNAME = "^[\\u4E00-\\u9FA5a-zA-Z0-9_]{1,}$";
  /**
   * 包括至少1个大写字母，1个小写字母，1个数字，1个特殊字符
   *  如果需要限制字符数改: ^.*(?=.){2,}+后面的  这样就最少2个
   *  特殊符号:  !@\.#$%^&*?=(){}[|,/\+-
   */
  String PASSWORD = "^.*(?=.)(?=.*\\d)(?=.*[A-Z])(?=.*[a-z])(?=.*[!@\\.#$%^&*?=(){}\\[\\]|,/\\+-]).*$";

}
